app/controllers/pins_controller.rb

  def index
    @pins = Pin.all.order("created_at DESC").paginate(:page => params[:page], :per_page => 30)
---
SELECT  "pins".* FROM "pins"   ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "pins"

  def create
    @pin = current_user.pins.build(pin_params)
    if @pin.save
---
INSERT INTO "pins" ("created_at", "description", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-07-28 14:19:18.310834"], ["description", "This pin should have a user."], ["updated_at", "2014-07-28 14:19:18.310834"], ["user_id", 2]]

  def update
    if @pin.update(pin_params)
---
UPDATE "pins" SET "description" = ?, "updated_at" = ? WHERE "pins"."id" = 1  [["description", "Yay! Yay"], ["updated_at", "2014-07-25 23:36:46.218825"]]